---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveHereInViewError
source: html/31ef7187-7959-d525-2f23-30c28eddcbd4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveHereInViewError Property

Can't move here at this view angle. Set another Work Plane or adjust the view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveHereInViewError { get; }
```